---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RibbonItem Properties
RibbonItem Class See Also Send Feedback
---

The RibbonItem type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Enabled | Gets or sets a value indicating whether the item is enabled. |
|  | ItemText | Gets or sets the text displayed on the item. |
|  | ItemType | Gets the item type. |
|  | LongDescription | Long description of the command tooltip |
|  | Name | The name of the item. |
|  | ToolTip | The description that appears as a ToolTip for the item. |
|  | ToolTipImage | The image to show as a part of the button extended tooltip |
|  | Visible | Gets or sets a value indicating whether the item is visible. |

# See Also

RibbonItem Class

Autodesk.Revit.UI Namespace